Guided Lab - 343.3.3 - Pandas Aggregate Functions

Lab Overview

In this lab, we will use pandas aggregation methods — such as count(), sum(), min(), max(), etc.—and the pandas groupby() function. These are very commonly used methods in data science and data engineering projects.

Instructions: 

In this lab, we will utilize the dummy zoo dataset.
Step 1: Let’s start with our “zoo” dataset! Click here for Download zoo.csv 
Step 2: Use below code for exploring the dataset

In [2]:
import pandas as pd
import numpy as np
zoo = pd.read_csv('zoo.csv', delimiter=',')
zoo

      animal  uniq_id  water_need
0   elephant     1001         500
1   elephant     1002         600
2   elephant     1003         550
3      tiger     1004         300
4      tiger     1005         320
5      tiger     1006         330
6      tiger     1007         290
7      tiger     1008         310
8      zebra     1009         200
9      zebra     1010         220
10     zebra     1011         240
11     zebra     1012         230
12     zebra     1013         220
13     zebra     1014         100
14     zebra     1015          80
15      lion     1016         420
16      lion     1017         600
17      lion     1018         500
18      lion     1019         390
19  kangaroo     1020         410
20  kangaroo     1021         430
21  kangaroo     1022         410

To learn the basic pandas aggregation methods, let’s do five things with this data:

Let’s count the number of rows (the number of animals) in a zoo!

Let’s calculate the total water_need of the animals!

Let’s find out which is the smallest water_need value!

And then the greatest water_need value!

And eventually the average water_need!

Example 1 - pandas count()

The most basic aggregation method is counting. To count the number of the animals is as easy as applying a count pandas function on the whole zoo dataframe:

In [4]:
zoo.count()

animal        22
uniq_id       22
water_need    22
dtype: int64

That’s interesting. “What are all these lines?” – you might ask…

Actually, the pandas .count() function counts the number of values in each column. In the case of the zoo dataset, there were 3 columns, and each of them had 22 values in it.

If you want to make your output clearer, you can select the animal column first by using one of the selection operators (that we learned about in the previous article). Something like this:

In [5]:
zoo[['animal']].count()

animal    22
dtype: int64

Or in this particular case, the result could be even nicer if you use this syntax:

In [6]:
zoo.animal.count()

22

Example 2 - sum() in pandas

Following the same logic, you can easily sum the values in the water_need column by typing:

In [7]:
zoo.water_need.sum()

7650

Just out of curiosity, let’s run our .sum() function on all columns, as well:

In [9]:
zoo.sum()

animal        elephantelephantelephanttigertigertigertigerti...
uniq_id                                                   22253
water_need                                                 7650
dtype: object

Note: .sum() turns the words of the animal column into one string of animal names. (By the way, it’s very much in line with the logic of Python.)

Example 3 - Pandas Data Aggregation #3 and #4: min() and max()

How to make pandas return the smallest value from the water_need column?

In [10]:
zoo.water_need.min()

80

In [11]:
zoo.water_need.max()

600

Example 4 - averages in pandas: mean() and median()

Eventually, let’s calculate statistical averages, like mean and median!
The syntax is the same as it was with the other aggregation methods above:

In [12]:
zoo.water_need.mean()

347.72727272727275

In [13]:
zoo.water_need.median()

325.0

So it’s time to spice this up — with a little bit of grouping! Introducing the groupby() function!

Example 5 - The pandas groupby() function
As a data scientist or engineer, you will probably do segmentations all the time. For instance, it’s nice to know the mean water_need of all animals (we have just learned that it’s 347.72). But very often it’s much more actionable to break this number down – let’s say – by animal types. With that, we can compare the species to each other. (Do lions or zebras drink more?) Or we can find outliers! (Elephants drink a lot!)
Here’s a simple visual showing how pandas performs “segmentation” – with groupby and aggregation:

It’s just grouping similar values and calculating the given aggregate value (in the above example it was a mean value) for each group.

Example 6 - Pandas groupby() – in action
Let’s do the above-presented grouping and aggregation for real, on our zoo DataFrame!
Use below statement

In [14]:
zoo.groupby('animal').mean()

          uniq_id  water_need
animal
elephant   1002.0  550.000000
kangaroo   1021.0  416.666667
lion       1017.5  477.500000
tiger      1006.0  310.000000
zebra      1012.0  184.285714

Just as before, pandas automatically runs the .mean() calculation for every column (the animal column disappeared since that was the column we grouped by). You can either ignore the uniq_id column or you can remove it afterward by using one of these syntaxes:

In [15]:
zoo.groupby('animal').mean()[['water_need']]

          water_need
animal
elephant  550.000000
kangaroo  416.666667
lion      477.500000
tiger     310.000000
zebra     184.285714

# –» This returns a DataFrame object.

Obviously, you can change the aggregation method from .mean() to anything, we learned above!

Let’s see one more example and combine pandas groupby() and coun() methods

I just wanted to add this example because it’s the most common operation you’ll do when you discover a new dataset. Using count() and groupby() together is just as simple as the previous example was.

In [16]:
zoo.groupby('animal').count()

          uniq_id  water_need
animal
elephant        3           3
kangaroo        3           3
lion            4           4
tiger           5           5
zebra           7           7

And magically the different animals are counted by pandas: